Revit 2027 API
NonContinuousRailStructure.AddNonContinuousRail Method
 Creates and appends a new Non-Continuous Rail to the Rail Structure. The new Non-Continuous Rail will have the given name, height and offset. It will have default profile and material ElementIds.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NonContinuousRailInfo AddNonContinuousRail(
	string name,
	double height,
	double offset
)
Public Function AddNonContinuousRail (
	name As String,
	height As Double,
	offset As Double
) As NonContinuousRailInfo
public:
NonContinuousRailInfo^ AddNonContinuousRail(
	String^ name,
	double height,
	double offset
)
member AddNonContinuousRail :
        name : string *
        height : float *
        offset : float -> NonContinuousRailInfo
Parameters
name String
 The name of the non-continuous rail.
height Double
 The height on which the non-continuous rail will be placed.
offset Double
 The offset of the non-continuous rail from a Railing center.
Return Value
NonContinuousRailInfo
 Handle to the new Non-Continuous Rail.
Exceptions
Exception | Condition
ArgumentException |  name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The name is a duplicate of an existing non-continuous rail. -or- The height height is not valid for the non-continuous rail because it is greater than the height of the RailingType to which it belongs.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for height must be no more than 30000 feet in absolute value. -or- The given value for offset must be no more than 30000 feet in absolute value.
See Also
Reference
NonContinuousRailStructure Class
Autodesk.Revit.DB.Architecture Namespace